feat: update litematic generator
